In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('Bengaluru_House_Data.csv')
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
df.shape

(13320, 9)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [5]:
df.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [6]:
for column in df.columns:
    print(df[column].value_counts())
    print()

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64

availability
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Oct               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: count, Length: 81, dtype: int64

location
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
3rd Stage Raja Rajeshwari Nagar      1
Chuchangatta Colony                  1
Electronic City Phase 1,             1
Chikbasavanapura                     1
Abshot Layout                        1
Name: count, Length: 1305, dtype: int64

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
14 BHK           1
12 Bedroom       1
13 BHK           1
18 Bedroom       1
Name: count, dtype: int64

society
GrrvaGr    80
PrarePa    76
Prtates    59
Sryalan    59
GMown E    56
           ..
SNadeAr     1
DSellil     1
Shensit     1
VKvenas     1
Vemes H     1
Name: count, Length: 2688, dtype: int64

total_sqft
1200           843
1100           221
1500           205
2400           196
600            180
              ...
2920             1
5665.84          1
1369             1
7150             1
1200 - 1470      1
Name: count, Length: 2117, dtype: int64

bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
27.0       1
14.0       1
40.0       1
15.0       1
18.0       1
Name: count, dtype: int64

balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64

price
75.00    310
65.00    302
55.00    275
60.00    270
45.00    240
        ...
43.04      1
61.11      1
46.56      1
42.54      1
47.35      1
Name: count, Length: 1994, dtype: int64

In [7]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [8]:
# We are dropping Society column as in total 13000 entries 5000 are null.
# The other columns are also not much useful to us so we are dropping them

df.drop(columns=['area_type','availability','society','balcony'],inplace=True)

In [9]:
df.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [10]:
print(df.info())
print()
print("Null values count:")
print(df.isnull().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB
None

Null values count:
location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [11]:
print(df['location'].value_counts())

# As there is only one missing value in Location we can just fill it with any one of the most occuring location
df['location'] = df['location'].fillna('Whitefield')

location
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
3rd Stage Raja Rajeshwari Nagar      1
Chuchangatta Colony                  1
Electronic City Phase 1,             1
Chikbasavanapura                     1
Abshot Layout                        1
Name: count, Length: 1305, dtype: int64

In [12]:
df['size'].value_counts()

# As most occuring is 2 BHK we will fill with it 

df['size'] = df['size'].fillna('2 BHK')

In [13]:
df['bath'].value_counts()

# As most occuring is 2 Bathrooms we will fill with it 

df['bath'] = df['bath'].fillna(df['bath'].median())
# We have filled all the null values

In [32]:
# In Size column we can see that the entries are not same some places it is like '2 BHK' and in some places it is like '2 Bedroom'
df['BHK'] = df['size'].str.split().str.get(0).astype(int)

In [34]:
# Outliers
df[df.BHK > 20]

                       location        size  total_sqft  bath  price  BHK
1718  2Electronic City Phase II      27 BHK      8000.0  27.0  230.0   27
4684                Munnekollal  43 Bedroom      2400.0  40.0  660.0   43

In [ ]:
# In the column total_sqft
df['total_sqft'].unique()

# Function for changing the entries to float and also to remove the ranges
def convert_sqft(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1])) / 2
    try:
        return float(temp[0])
    except:
        return None
    
df['total_sqft'] = df['total_sqft'].apply(convert_sqft)

In [ ]:
# We are gonna make a new column for calculating the price per square feet as in the current data it is for the total sqft
df['price_per_sqft'] = df['price']*100000 / df['total_sqft']

df['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [39]:
df.describe()

         total_sqft          bath         price           BHK  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [57]:
# Now in the location column as there are 1305 entries if we encode it, it will be very huge and will negatively effect our model (The Curse of Dimensionality)

# First we remove the whitespaces if any

df['location'] = df['location'].apply(lambda x: x.strip())

# We reduce the size by clubbing all less frequent entries into Other
location_stats = df['location'].value_counts()
location_stats_less_than_10 = location_stats[location_stats <= 10]

print('Number of locations appearing less than 10: ',len(location_stats_less_than_10))

df['location'] = df['location'].apply(lambda x: "Other" if x in location_stats_less_than_10 else x)

Number of locations appearing less than 10:  1053

In [58]:
df['location'].value_counts()

location
Other                        2885
Whitefield                    542
Sarjapur  Road                399
Electronic City               304
Kanakpura Road                273
                             ...
Tindlu                         11
Marsur                         11
2nd Phase Judicial Layout      11
Thyagaraja Nagar               11
HAL 2nd Stage                  11
Name: count, Length: 242, dtype: int64

### OUTLIER DETECTION

In [60]:
# There are some outliers like in the min(total_sqft) = 1.0000 which is an outlier
df.describe()

         total_sqft          bath         price           BHK  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [63]:
# This will give us the sqft of a single room
(df['total_sqft']/df['BHK']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [ ]:
# We took a threshold like any house with sqft of a single room < 300 will be removed or else it is very small room not in real world
df = df[((df['total_sqft']/df['BHK']) >= 300)]
df.describe()

         total_sqft          bath         price           BHK  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838     6303.979357
std     1261.271296      1.077938    152.077329      0.976678     4162.237981
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1116.000000      2.000000     49.000000      2.000000     4210.526316
50%     1300.000000      2.000000     70.000000      3.000000     5294.117647
75%     1700.000000      3.000000    115.000000      3.000000     6916.666667
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [67]:
# For the price_per_sqft the max value is 176470 (which is nearly 28 times mean) so it is an outlier
def remove_outlier_sqft(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = m = np.std(subdf.price_per_sqft)
        gen_df = subdf[((subdf.price_per_sqft > (m-st)) & (subdf.price_per_sqft < (m+st)))]
        df_output = pd.concat([df_output,gen_df],ignore_index=True)
    return df_output

df = remove_outlier_sqft(df)
df.describe()

         total_sqft        bath       price         BHK  price_per_sqft
count    878.000000  878.000000  878.000000  878.000000      878.000000
mean    1672.617210    2.347380   53.883001    2.490888     3782.544850
std     3121.372013    1.168305   34.949891    1.167513      734.087873
min      400.000000    1.000000    8.440000    1.000000      267.829813
25%     1067.250000    2.000000   38.735000    2.000000     3457.575758
50%     1201.000000    2.000000   48.000000    2.000000     3926.902537
75%     1464.000000    3.000000   58.000000    3.000000     4333.333333
max    52272.000000   12.000000  525.000000   11.000000     5000.000000

In [72]:
df['BHK'].describe()

count    878.000000
mean       2.490888
std        1.167513
min        1.000000
25%        2.000000
50%        2.000000
75%        3.000000
max       11.000000
Name: BHK, dtype: float64